tap "homebrew/bundle"
tap "romkatv/gitstatus"
# General-purpose data compression with high compression ratio
brew "xz"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# High performance key/value database
brew "berkeley-db@4"
# Parser generator
brew "bison"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Vector graphics library with cross-device output support
brew "cairo"
# Ruby environment tool
brew "chruby"
# Pack, ship and run any application as a lightweight container
brew "docker"
# GitHub command-line tool
brew "gh"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Portable Foreign Function Interface library
brew "libffi"
# YAML Parser
brew "libyaml"
# Java-based project management
brew "maven"
# Platform built on V8 to build network applications
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Git status for Bash/Zsh prompt
brew "romkatv/gitstatus/gitstatus"
# Command-line interface for 1Password
cask "1password-cli"
cask "font-fira-code"
# Clipboard manager
cask "maccy"
# Simple menu bar app to view and interact with reminders
cask "reminders-menubar"
