4ops.terraform
anysphere.cpptools
anysphere.cursorpyright
anysphere.remote-containers
anysphere.remote-ssh
anysphere.remote-wsl
codezombiech.gitignore
cschlosser.doxdocgen
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
docker.docker
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
enkia.tokyo-night
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
google.gemini-cli-vscode-ide-companion
grapecity.gc-excelviewer
hashicorp.hcl
hashicorp.terraform
humao.rest-client
jeff-hykin.better-cpp-syntax
llvm-vs-code-extensions.vscode-clangd
mcright.auto-save
mechatroner.rainbow-csv
michelemelluso.code-beautifier
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
msjsdiag.vscode-react-native
okteto.kubernetes-context
openai.chatgpt
pkief.material-icon-theme
raillyhugo.one-hunter
redhat.vscode-yaml
tamasfe.even-better-toml
twxs.cmake
vadimcn.vscode-lldb
vscjava.vscode-gradle
vscode-icons-team.vscode-icons
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
